appNotes/backend/app/controllers/api/v2/users_controller.rb

  def index
    users = User.all()
---
SELECT "users".* FROM "users"

  def create
    user = User.new(name: user_params[:name], surname: user_params[:surname], email: user_params[:email], password:user_params[:password], rol:user_params[:rol])
    if user.save
---
INSERT INTO "users" ("name", "surname", "email", "password", "rol", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)