appNotes/backend/app/controllers/api/v3/notesusers_controller.rb

  def create
    noteuser = NoteUser.new(noteid: user_params[:noteid], useremail: user_params[:useremail])
    if noteuser.save
---
INSERT INTO "note_users" ("noteid", "useremail", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["noteid", "18"], ["useremail", " "], ["created_at", "2023-03-17 11:27:49.815654"], ["updated_at", "2023-03-17 11:27:49.815654"]]