appNotes/backend/app/controllers/api/v1/notes_controller.rb

  def index
    notes = Note.all()
---
SELECT "notes".* FROM "notes"

  def create
    note = Note.new(title: note_params[:title], body: note_params[:body], author: note_params[:author], date:note_params[:date], image:note_params[:image])
    if note.save
---
INSERT INTO "notes" ("title", "body", "author", "date", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    note = Note.find_by(id:params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def update
    note = Note.find(params[:id])

    if note
      note.update(title: params[:title], body: params[:body], author: params[:author], date:params[:date], image:params[:image])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "notes" SET "title" = ?, "body" = ?, "author" = ?, "date" = ?, "image" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "aaa"], ["body", "aaa"], ["author", "aaa"], ["date", "2023-03-17"], ["image", "C:\\fakepath\\imagenPrueba.PNG"], ["updated_at", "2023-03-16 11:26:19.564731"], ["id", 11]]

  def destroy
    note = Note.find(params[:id])
    if note
      note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 17]]